/*==============================================================================

   頂点管理[player.h]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// プレイヤー構造体
struct PLAYER
{

	D3DXVECTOR3		pos;		// 位置
	D3DXVECTOR3		oldpos;		// 前の位置
	D3DXVECTOR3		drawpos;	// 実際の表示の位置
	D3DXVECTOR3		rot;		// 向き(回転)
	D3DXVECTOR3		size;		// 大きさ
	D3DXVECTOR3		scl;		// 大きさの倍率

	int				texNo;		// テクスチャ
	int				act;		// どういう状態か(アニメーションとかの時使う)

	D3DXVECTOR3		move;		// 移動の力,キーを入力していなければ毎フレームごとに止まろうとする,空中とか滑りやすさで止まろうとする力は変わる

	bool			ground;		// 地面に足を付けている状態かどうか


	bool			isUse;		// true:使っている  false:未使用

};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

PLAYER *GetPlayer(void);
